# 01 Titanic dataset preprocessing
1. 필요 없는 column을 지워보세요.
2. 이번엔 age는 mean으로, Embarked는 median으로 imputation해보세요.
3. Sex, Embarked column을 정수 인코딩 해보세요.

In [53]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()
del df['PassengerId']
del df['Name']
del df['Ticket']
del df['Cabin']

In [54]:
df['Sex']

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: str

In [55]:
df.columns

Index(['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Embarked'],
      dtype='str')

In [56]:
mapping = {'male':0, 'female':1}

In [57]:
df['Sex'] = df['Sex'].map(mapping)

In [58]:
df.info()
df.isnull()
import seaborn as sns
df['Age'].mean()
df['Age'] = df['Age'].fillna(df['Age'].mean())

<class 'pandas.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    int64
 3   Age       714 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    float64
 7   Embarked  889 non-null    str
dtypes: float64(2), int64(5), str(1)
memory usage: 55.8 KB

In [59]:
df['Embarked'] = df['Embarked'].fillna(df['Embarked'].mode()[0])
embarked_mapping = {'Q':0, 'S':1, 'C':2}
df['Embarked'].map(embarked_mapping)
df['Embarked'] = df['Embarked'].map(embarked_mapping)

In [60]:
df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    0  22.0      1      0   7.2500         1
1         1       1    1  38.0      1      0  71.2833         2
2         1       3    1  26.0      0      0   7.9250         1
3         1       1    1  35.0      1      0  53.1000         1
4         0       3    0  35.0      0      0   8.0500         1